app/controllers/snippets_controller.rb

SELECT "snippets".* FROM "snippets"
---
  def index
    @snippets = Snippet.all

SELECT "snippets".* FROM "snippets" WHERE "snippets"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def show
    @snippet = Snippet.find(params[:id])

INSERT INTO "snippets" ("created_at", "description", "gist_id", "language", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @params = params.to_json
    if params[:snippet][:user_id] == current_user.id.to_s
      if params[:gist][:gist_content]
        unless params[:snippet][:gist_id].empty?
          # Gave an ID and content. Which one do you prefer?
        else
          # Create new gist before saving snippet
          client = Octokit::Client.new(:login => current_user.username, :oauth_token => current_user.token)
          gist = client.create_gist({:description => params[:snippet][:description],
                                      :public => true,
                                      :files => { "file1" => { :content => params[:gist][:gist_content] } } })
          @gist = gist.to_json
          params[:snippet][:gist_id] = gist.id
        end
      end
      @snippet = Snippet.create params[:snippet]