app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'tybenz' LIMIT 1
---
  def register
    auth = request.env['omniauth.auth']
    user_info = auth[:info]
    token = auth[:credentials][:token]
    local_user = User.find_by_username(user_info[:nickname])